Repository: mdportnov/privbird-notes
Catalog: backend/feedback/feedback/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Invalid data.
ru: Некорректные данные.

source: The requested resource was not found.
ru: Запрашиваемый ресурс не найден.

source: There was an error.Try again or contact support!
ru: Произошла ошибка. Попробуйте еще раз или обратитесь в службу поддержки!

source: Request limit reached.
ru: Достигнут лимит запросов.

source: The feedback was successfully sent.
ru: Обращение успешно отправлено.

source: The note has been successfully created.The note will be destroyed after reading it!Don’t forget to copy the link!
ru: Заметка успешно создана. Заметка будет уничтожена после прочтения! Не забудьте скопировать ссылку!

source: The note was successfully received.
ru: Заметка успешно получена.

source: You have entered the wrong password. Try again.
ru: Вы ввели неправильный пароль. Попробуйте снова.

source: Could not find a note.
ru: Не удалось найти заметку.

source: This note has a password.Enter it to view the information.
ru: У этой заметки есть пароль. Введите его, чтобы просмотреть информацию.

source: PrivBird notification
ru: Уведомление от PrivBird

source: fake
ru: фейковая

source: the next time someone reads it, a fake note will be displayed
ru: при следующем прочтении будет отображена фейковая записка

source: the content was destroyed
ru: содержимое уничтожено

source: The {real} note with ID {id} has just been read, {ending}.
ru: {real} записка с ID {id} была только что прочитана, {ending}.
