Repository: mdportnov/privbird-notes
Catalog: backend/privnote/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Invalid data.
ru: Некорректные данные.

source: The requested resource was not found.
ru: Запрашиваемый ресурс не найден.

source: There was an error.Try again or contact support!
ru: Произошла ошибка. Попробуйте еще раз или обратитесь в службу поддержки!

source: Request limit reached.
ru: Достигнут лимит запросов.

source: The note has been successfully created.The note will be destroyed after reading it!Don’t forget to copy the link!
ru: Заметка успешно создана.После прочтения заметка будет уничтожена!Не забудьте скопировать ссылку!

source: The note was successfully received.
ru: Записка успешно получена.

source: You have entered the wrong password. Try again.
ru: Вы ввели неверный пароль. Попробуйте еще раз.

source: Could not find a note.
ru: Не удалось найти заметку.

source: This note has a password.Enter it to view the information.
ru: У этой заметки есть пароль.Введите его, чтобы просмотреть содержимое.

source: PrivBird notification
ru: Уведомление PrivBird

source: fake
ru: фейковая

source: the next time someone reads it, a fake note will be displayed
ru: в следующий раз, когда кто-то прочитает её, будет отображена фейковая заметка

source: the content was destroyed
ru: содержимое было уничтожено

source: The {is_real} note with ID {id} has just been read, {ending}.
ru: Только что прочитана {is_real} заметка с идентификатором {id}, {ending}.

source: Invalid basic header. No credentials provided.
ru: Неверный basic заголовок. Учетные данные не предоставлены.

source: Invalid basic header. Credentials string should not contain spaces.
ru: Неверный basic заголовок. Строка учетных данных не должна содержать пробелов.

source: Invalid basic header. Credentials not correctly base64 encoded.
ru: Неверный basic заголовок. Учетные данные неправильно закодированы в base64.

source: Invalid username/password.
ru: Неправильное имя/пароль.

source: User inactive or deleted.
ru: Пользователь неактивен или удален.

source: Invalid token header. No credentials provided.
ru: Недопустимый заголовок токена. Учетные данные не предоставлены.

source: Invalid token header. Token string should not contain spaces.
ru: Недопустимый заголовок токена. Строка токена не должна содержать пробелов.

source: Invalid token header. Token string should not contain invalid characters.
ru: Недопустимый заголовок токена. Строка токена не должна содержать недопустимых символов.

source: Invalid token.
ru: Неверный токен.

source: Auth Token
ru: Токен авторизации

source: Key
ru: Ключ

source: User
ru: Пользователь

source: Created
ru: Созданный

source: Token
ru: Токен

source: Tokens
ru: Токены

source: Username
ru: Имя пользователя

source: Password
ru: Пароль

source: Unable to log in with provided credentials.
ru: Невозможно войти с предоставленными учетными данными.

source: Must include "username" and "password".
ru: Должен включать "username" и "password".

source: A server error occurred.
ru: Произошла ошибка сервера.

source: Invalid input.
ru: Неправильный ввод.

source: Malformed dto.
ru: Неправильный запрос.

source: Incorrect authentication credentials.
ru: Неправильные учетные данные аутентификации.

source: Authentication credentials were not provided.
ru: Учетные данные для аутентификации не были предоставлены.

source: You do not have permission to perform this action.
ru: У вас нет разрешения на выполнение этого действия.

source: Not found.
ru: Не найден.

source: Method "{method}" not allowed.
ru: Метод "{метод}" не разрешен.

source: Could not satisfy the dto Accept header.
ru: Не удалось удовлетворить заголовок Accept запроса.

source: Unsupported media type "{media_type}" in dto.
ru: Неподдерживаемый тип мультимедиа "{media_type}" в запросе.

source: Request was throttled.
ru: Запрос был ограничен.

source: Expected available in {wait} second.
ru: Доступен через {wait} секунд.

source: Expected available in {wait} seconds.
ru: Доступен через {wait} секунд.

source: This field is required.
ru: Это поле обязательно к заполнению.

source: This field may not be null.
ru: Это поле не может быть нулевым.

source: Must be a valid boolean.
ru: Должно быть допустимым логическим значением.

source: Not a valid string.
ru: Недопустимая строка.

source: This field may not be blank.
ru: Это поле не может быть пустым.

source: Ensure this field has no more than {max_length} characters.
ru: Убедитесь, что в этом поле не более {max_length} символов.

source: Ensure this field has at least {min_length} characters.
ru: Убедитесь, что это поле содержит не менее {min_length} символов.

source: Enter a valid email address.
ru: Введите действительный адрес электронной почты.

source: This value does not match the required pattern.
ru: Это значение не соответствует требуемому шаблону.

source: Enter a valid "slug" consisting of letters, numbers, underscores or hyphens.
ru: Введите допустимый «слаг», состоящий из букв, цифр, знаков подчеркивания или дефисов.

source: Enter a valid "slug" consisting of Unicode letters, numbers, underscores, or hyphens.
ru: Введите допустимый "slug", состоящий из букв Unicode, цифр, символов подчеркивания или дефисов.

source: Enter a valid URL.
ru: Введите действительный URL-адрес.

source: Must be a valid UUID.
ru: Должен быть допустимым UUID.

source: Enter a valid IPv4 or IPv6 address.
ru: Введите действительный адрес IPv4 или IPv6.

source: A valid integer is required.
ru: Требуется допустимое целое число.

source: Ensure this value is less than or equal to {max_value}.
ru: Убедитесь, что это значение меньше или равно {max_value}.

source: Ensure this value is greater than or equal to {min_value}.
ru: Убедитесь, что это значение больше или равно {min_value}.

source: String value too large.
ru: Слишком большое строковое значение.

source: A valid number is required.
ru: Требуется действительный номер.

source: Ensure that there are no more than {max_digits} digits in total.
ru: Убедитесь, что общее число цифр не превышает {max_digits}.

source: Ensure that there are no more than {max_decimal_places} decimal places.
ru: Убедитесь, что число десятичных разрядов не превышает {max_decimal_places}.

source: Ensure that there are no more than {max_whole_digits} digits before the decimal point.
ru: Убедитесь, что до десятичной точки не более {max_whole_digits} цифр.

source: Datetime has wrong format. Use one of these formats instead: {format}.
ru: Datetime имеет неправильный формат. Вместо этого используйте один из следующих форматов: {format}.

source: Expected a datetime but got a date.
ru: Ожидал дату и время, но получил дату.

source: Invalid datetime for the timezone "{timezone}".
ru: Недопустимая дата и время для часового пояса "{timezone}".

source: Datetime value out of range.
ru: Значение даты и времени вне допустимого диапазона.

source: Date has wrong format. Use one of these formats instead: {format}.
ru: Дата имеет неправильный формат. Вместо этого используйте один из следующих форматов: {format}.

source: Expected a date but got a datetime.
ru: Ожидал свидания, но получил дату и время.

source: Time has wrong format. Use one of these formats instead: {format}.
ru: Время имеет неправильный формат. Вместо этого используйте один из следующих форматов: {format}.

source: Duration has wrong format. Use one of these formats instead: {format}.
ru: Длительность имеет неправильный формат. Вместо этого используйте один из следующих форматов: {format}.

source: "{input}" is not a valid choice.
ru: "{input}" не является допустимым выбором.

source: More than {count} items...
ru: Более {count} элементов...

source: Expected a list of items but got type "{input_type}".
ru: Ожидал список элементов, но получил тип "{input_type}".

source: This selection may not be empty.
ru: Этот выбор не может быть пустым.

source: "{input}" is not a valid path choice.
ru: "{input}" не является допустимым выбором пути.

source: No file was submitted.
ru: Файл не отправлен.

source: The submitted data was not a file. Check the encoding type on the form.
ru: Представленные данные не были файлом. Проверьте тип кодировки в форме.

source: No filename could be determined.
ru: Не удалось определить имя файла.

source: The submitted file is empty.
ru: Представленный файл пуст.

source: Ensure this filename has at most {max_length} characters (it has {length}).
ru: Убедитесь, что это имя файла содержит не более {max_length} символов (у него {length}).

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
ru: Загрузите допустимое изображение. Загруженный файл либо не является изображением, либо является поврежденным.

source: This list may not be empty.
ru: Этот список не может быть пустым.

source: Ensure this field has at least {min_length} elements.
ru: Убедитесь, что в этом поле есть как минимум {min_length} элементов.

source: Ensure this field has no more than {max_length} elements.
ru: Убедитесь, что в этом поле не более {max_length} элементов.

source: Expected a dictionary of items but got type "{input_type}".
ru: Ожидался словарь элементов, но получен тип "{input_type}".

source: This dictionary may not be empty.
ru: Этот словарь не может быть пустым.

source: Value must be valid JSON.
ru: Значение должно быть допустимым JSON.

source: Search
ru: Поиск

source: A search term.
ru: Поисковый запрос.

source: Ordering
ru: Заказ

source: Which field to use when ordering the results.
ru: Какое поле использовать при заказе результатов.

source: ascending
ru: Восходящий

source: descending
ru: нисходящий

source: A page number within the paginated result set.
ru: Номер страницы в наборе результатов с разбивкой на страницы.

source: Number of results to return per page.
ru: Количество результатов, возвращаемых на страницу.

source: Invalid page.
ru: Недопустимая страница.

source: The initial index from which to return the results.
ru: Начальный индекс, из которого возвращаются результаты.

source: The pagination cursor value.
ru: Значение курсора разбиения на страницы.

source: Invalid cursor
ru: Неверный курсор

source: Invalid id "{pk_value}" - object does not exist.
ru: Недопустимый id "{pk_value}" - объект не существует.

source: Incorrect type. Expected id value, received {data_type}.
ru: Неправильный тип. Ожидаемое значение id, получено {data_type}.

source: Invalid hyperlink - No URL match.
ru: Недействительная гиперссылка — URL-адрес не совпадает.

source: Invalid hyperlink - Incorrect URL match.
ru: Недействительная гиперссылка — неверное соответствие URL.

source: Invalid hyperlink - Object does not exist.
ru: Неверная гиперссылка — объект не существует.

source: Incorrect type. Expected URL string, received {data_type}.
ru: Неправильный тип. Ожидаемая строка URL, получено {data_type}.

source: Object with {slug_name}={value} does not exist.
ru: Объект с {slug_name}={value} не существует.

source: Invalid value.
ru: Неверное значение.

source: unique integer value
ru: уникальное целочисленное значение

source: UUID string
ru: строка UUID

source: unique value
ru: уникальное значение

source: A {value_type} identifying this {name}.
ru: {value_type}, идентифицирующий это {name}.

source: Invalid data. Expected a dictionary, but got {datatype}.
ru: Неверные данные. Ожидал словарь, но получил {datatype}.

source: Extra Actions
ru: Дополнительные действия

source: Filters
ru: Фильтры

source: navbar
ru: панель навигации

source: content
ru: содержание

source: dto form
ru: форма запроса

source: main content
ru: основное содержание

source: dto info
ru: запросить информацию

source: response info
ru: информация об ответе

source: None
ru: Никто

source: No items to select.
ru: Нет элементов для выбора.

source: This field must be unique.
ru: Это поле должно быть уникальным.

source: The fields {field_names} must make a unique set.
ru: Поля {field_names} должны составлять уникальный набор.

source: Surrogate characters are not allowed: U+{code_point:X}.
ru: Суррогатные символы не допускаются: U+{code_point:X}.

source: This field must be unique for the "{date_field}" date.
ru: Это поле должно быть уникальным для даты "{date_field}".

source: This field must be unique for the "{date_field}" month.
ru: Это поле должно быть уникальным для месяца "{date_field}".

source: This field must be unique for the "{date_field}" year.
ru: Это поле должно быть уникальным для года "{date_field}".

source: Invalid version in "Accept" header.
ru: Недопустимая версия в заголовке «Принять».

source: Invalid version in URL path.
ru: Недопустимая версия в пути URL.

source: Invalid version in URL path. Does not match any version namespace.
ru: Недопустимая версия в пути URL. Не соответствует ни одному пространству имен версии.

source: Invalid version in hostname.
ru: Недопустимая версия в имени хоста.

source: Invalid version in query parameter.
ru: Недопустимая версия в параметре запроса.
